ESBComponents/MessageValidator/src/test/resources/Scenario1_PD_Response.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd">
	<S:Header>
		<To xmlns="http://www.w3.org/2005/08/addressing">http://www.w3.org/2005/08/addressing/anonymous</To>
		<Action xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201306UV02:CrossGatewayPatientDiscovery</Action>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:e1003c2a-c84c-4039-ab86-b6f834a10366</MessageID>
		<RelatesTo xmlns="http://www.w3.org/2005/08/addressing">uuid:5a1642a8-21c7-48df-bfd5-fda45bb7c8d8</RelatesTo>
		<wsse:Security S:mustUnderstand="true">
			<wsu:Timestamp wsu:Id="_1" xmlns:ns15="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns14="http://schemas.xmlsoap.org/soap/envelope/">
				<wsu:Created>2012-02-06T19:10:32Z</wsu:Created>
				<wsu:Expires>2012-02-06T19:15:32Z</wsu:Expires>
			</wsu:Timestamp>
			<wsse11:SignatureConfirmation wsu:Id="_5002" Value="I1BAx/ykNOYGj68XavGmfatlX+3za0fTL93crTTUcXjkjxi5i8Wnqu/qrbKsquwfXxFyAFT1+26ZFPxazMnZfOat6dcySemQa7JgHHO8DFi3MNLYhDCmRPcAHVlqFOB0Qt3qa6DriJNiOXKlTMEtMdaF9sWRGO8qsyEmWh4j6FQwtK6fAWR8Vf2KMckvCycRvr642MKTYRxAvbh4/Tei25v22S3EQPu361EV2UG8Rt09e3WBUuygIc7IotOay0dDmsijGCUsfW59wJLZN/3qSvy0QdCull8H4B6+WBD2a/eeqUoBHa0GePNC+00Cy0441E96N2eHZXqOAqjmepWYtQ==" xmlns:ns15="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns14="http://schemas.xmlsoap.org/soap/envelope/"/>
		</wsse:Security>
	</S:Header>
	<S:Body>
		<PRPA_IN201306UV02 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3" xmlns:ns2="urn:gov:hhs:fha:nhinc:common:nhinccommon" xmlns:ns3="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:ns4="urn:gov:hhs:fha:nhinc:common:patientcorrelationfacade">
			<id extension="-31758b04:1353509dd58:-6a11" root="2.16.840.1.113883.0.101"/>
			<creationTime value="201226191029"/>
			<interactionId extension="PRPA_IN201306UV" root="2.16.840.1.113883.1.6"/>
			<processingCode code="P"/>
			<processingModeCode code="R"/>
			<acceptAckCode code="AL"/>
			<receiver typeCode="RCV">
				<device determinerCode="INSTANCE" classCode="">
					<id root="1.2.345.678.999"/>
					<asAgent classCode="AGNT">
						<representedOrganization determinerCode="INSTANCE" classCode="ORG">
							<id root="2.16.840.1.113883.0.210"/>
						</representedOrganization>
					</asAgent>
				</device>
			</receiver>
			<sender typeCode="SND">
				<device determinerCode="INSTANCE" classCode="">
					<id root="1.2.345.678.999"/>
					<asAgent classCode="AGNT">
						<representedOrganization determinerCode="INSTANCE" classCode="ORG">
							<id root="2.16.840.1.113883.0.101"/>
						</representedOrganization>
					</asAgent>
				</device>
			</sender>
			<acknowledgement>
				<typeId extension="PRPA_IN201305UV02" root="2.16.840.1.113883.1.6"/>
				<typeCode code="AA"/>
				<targetMessage xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
			</acknowledgement>
			<controlActProcess moodCode="EVN" classCode="">
				<code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV"/>
				<authorOrPerformer typeCode="AUT">
					<assignedDevice classCode="">
						<id root="2.16.840.1.113883.0.101"/>
					</assignedDevice>
				</authorOrPerformer>
				<subject typeCode="SUBJ">
					<registrationEvent moodCode="" classCode="">
						<id nullFlavor="NA"/>
						<statusCode code="active"/>
						<subject1 typeCode="">
							<patient classCode="PAT">
								<id extension="RI1.101.00037" root="2.16.840.1.113883.0.101"/>
								<statusCode code="SD"/>
								<patientPerson>
									<name>
										<family partType="FAM">Marquez</family>
										<given partType="GIV">Marta</given>
									</name>
									<telecom value="tel:+1-987-555-9000"/>
									<administrativeGenderCode code="F"/>
									<birthTime value="19701001"/>
									<addr>
										<streetAddressLine>19591 Springs Pl</streetAddressLine>
										<city>Atlanta</city>
										<state>GA</state>
										<postalCode>30345</postalCode>
									</addr>
									<asOtherIDs classCode="SD">
										<id extension="666660037" root="2.16.840.1.113883.4.1"/>
										<scopingOrganization determinerCode="" classCode="">
											<id root="2.16.840.1.113883.4.1"/>
										</scopingOrganization>
									</asOtherIDs>
								</patientPerson>
								<providerOrganization determinerCode="" classCode="">
									<id root="2.16.840.1.113883.0.101"/>
									<contactParty xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
								</providerOrganization>
								<subjectOf1>
									<queryMatchObservation moodCode="" classCode="">
										<code code="IHE_PDQ"/>
										<value xsi:type="INT" value="100" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
									</queryMatchObservation>
								</subjectOf1>
							</patient>
						</subject1>
						<custodian typeCode="">
							<assignedEntity classCode="">
								<id root="2.16.840.1.113883.0.101"/>
							</assignedEntity>
						</custodian>
					</registrationEvent>
				</subject>
				<queryAck>
					<queryId extension="-abd3453dcd24wkkks545" root="2.16.840.1.113883.0.210"/>
					<queryResponseCode code="OK"/>
					<resultTotalQuantity value="1"/>
					<resultCurrentQuantity value="1"/>
					<resultRemainingQuantity value="0"/>
				</queryAck>
				<queryByParameter xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
					<queryId extension="-abd3453dcd24wkkks545" root="2.16.840.1.113883.0.210"/>
					<statusCode code="new"/>
					<responseModalityCode code="R"/>
					<responsePriorityCode code="I"/>
					<parameterList>
						<livingSubjectAdministrativeGender>
							<value code="F"/>
							<semanticsText representation="TXT"/>
						</livingSubjectAdministrativeGender>
						<livingSubjectBirthTime>
							<value value="19701001"/>
							<semanticsText representation="TXT"/>
						</livingSubjectBirthTime>
						<livingSubjectId>
							<value extension="VEN21000037" root="2.16.840.1.113883.0.210"/>
							<semanticsText representation="TXT"/>
						</livingSubjectId>
						<livingSubjectName>
							<value>
								<family partType="FAM">Marquez</family>
								<given partType="GIV">Marta</given>
							</value>
							<semanticsText representation="TXT"/>
						</livingSubjectName>
						<patientAddress>
							<value/>
						</patientAddress>
					</parameterList>
				</queryByParameter>
			</controlActProcess>
		</PRPA_IN201306UV02>
	</S:Body>
</S:Envelope>
